#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/paperphyte/terraform-drone/runs/run-EErZXSzZMfbpzmws

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.server.random_string.server_secret: Refreshing state... [id=vPFoijtJNJZB7xUg4PcMLtRJxAivlR4l]
module.server.random_string.database_secret: Refreshing state... [id=FKgZ233erJqYUrjfrp1HKc4JoaI5jKjs]
module.server.module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=jUbSEA]
aws_cloudwatch_log_group.drone: Refreshing state... [id=drone-cluster]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-074292ec0c02841b6]
module.defaultrunner.module.drone_runner_task.aws_iam_role.ecs_task_role: Refreshing state... [id=drone-drone_micro-runner_ecs_task_role]
module.defaultrunner.aws_iam_role.ecs_instance: Refreshing state... [id=drone_micro-ecs-instance-role]
module.server.module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=drone-20211013170624007700000001]
module.server.aws_iam_role.instance_helper: Refreshing state... [id=drone-instance-helper]
module.server.aws_ssm_parameter.database_secret: Refreshing state... [id=/drone/server/database_secret]
module.server.aws_ssm_parameter.rpc_secret: Refreshing state... [id=/drone/server/rpc_secret]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0dadf42dc694bcb7e]
module.server.module.drone_server_task.aws_iam_role.ecs_task_role: Refreshing state... [id=drone-server_ecs_task_role]
module.defaultrunner.aws_iam_role_policy_attachment.ecs_ec2_role: Refreshing state... [id=drone_micro-ecs-instance-role-20211016103630440300000004]
module.defaultrunner.aws_iam_role_policy_attachment.ecs_ec2_ecr_role: Refreshing state... [id=drone_micro-ecs-instance-role-20211016103630636300000007]
module.defaultrunner.aws_iam_role_policy_attachment.ecs_ec2_cloudwatch_role: Refreshing state... [id=drone_micro-ecs-instance-role-20211016103630450500000005]
module.defaultrunner.aws_iam_role_policy_attachment.ecs_spotfleetscale_role: Refreshing state... [id=drone_micro-ecs-instance-role-20211016103630643900000008]
module.defaultrunner.aws_iam_instance_profile.ecs_instance: Refreshing state... [id=drone_micro_ecs_instance_profile]
module.defaultrunner.module.drone_runner_task.aws_iam_role_policy_attachment.task_execution: Refreshing state... [id=drone-drone_micro-runner_ecs_task_role-20211016103630433500000002]
module.defaultrunner.module.drone_runner_task.aws_iam_role_policy_attachment.task_ssm_read: Refreshing state... [id=drone-drone_micro-runner_ecs_task_role-20211016103630439100000003]
module.server.module.drone_server_task.aws_iam_policy.task_ssm_policy: Refreshing state... [id=arn:aws:iam::277223786451:policy/drone-server_task_ssm_policy]
module.server.aws_iam_role_policy_attachment.instance_helper: Refreshing state... [id=drone-instance-helper-20211013164519682400000003]
module.server.aws_iam_instance_profile.instance_helper: Refreshing state... [id=drone-instance-helper]
module.defaultrunner.module.drone_runner_task.aws_iam_policy.task_ssm_policy: Refreshing state... [id=arn:aws:iam::277223786451:policy/drone-drone_micro-runner_task_ssm_policy]
module.server.module.drone_server_task.aws_iam_role_policy_attachment.task_ssm_read: Refreshing state... [id=drone-server_ecs_task_role-20211013164519793600000005]
module.server.module.drone_server_task.aws_iam_role_policy_attachment.task_execution: Refreshing state... [id=drone-server_ecs_task_role-20211013164519780100000004]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-north-1:277223786451:cluster/drone-cluster]
module.defaultrunner.module.drone_runner_task.aws_ecs_task_definition.task_definition: Refreshing state... [id=drone_micro-runner]
module.server.module.drone_server_task.aws_iam_role_policy_attachment.task_kms: Refreshing state... [id=drone-server_ecs_task_role-20211013164519668700000002]
module.defaultrunner.module.drone_runner_task.aws_iam_role_policy_attachment.task_kms: Refreshing state... [id=drone-drone_micro-runner_ecs_task_role-20211016103630476100000006]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a9ad92e79fb6b0fd]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-026f77cde025f255b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07ca98e1dcf74d47e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0008a9d765274cbc7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03b9946a49e2d7c7f]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-05d70530cbbdd3de4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-082c377a26e190e80]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04835de384862f0b6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0533ea21625b519d2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-026f77cde025f255b1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d189371806c4dc5d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-069e358eb52628922]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-06baac68193760ef9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-051dfed3bdfa979fc]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07bc8f72b75e979e5]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01cb83be292135123]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a1ad57e61f6e3788]
module.defaultrunner.aws_security_group.runner: Refreshing state... [id=sg-0a27d9aec5ab3b9f9]
module.server.module.drone_lb.aws_lb_target_group.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:targetgroup/drone-target-group/48855de92e8afc88]
module.defaultrunner.module.drone_runner_task.aws_security_group.service_sg: Refreshing state... [id=sg-05ca9e881cfe1a660]
module.server.module.drone_lb.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-north-1:277223786451:certificate/62631c8e-cc9f-4e3f-83aa-db7da3024e74]
module.server.aws_s3_bucket.drone_build_log_storage: Refreshing state... [id=drone.paperphyte.com-console-logs]
module.server.module.drone_lb.aws_service_discovery_private_dns_namespace.private_dns_namespace: Refreshing state... [id=ns-hjadiwh7h27udzyx]
module.server.module.drone_lb.aws_security_group.lb: Refreshing state... [id=sg-0f95737b9ea2b3d3f]
module.server.aws_security_group.db: Refreshing state... [id=sg-0f030f521ca4c2545]
module.server.module.drone_server_task.aws_security_group.service_sg: Refreshing state... [id=sg-081a036f662f3d400]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a9ad92e79fb6b0fd1080289494]
module.server.module.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=drone-20211013170624577400000002]
module.defaultrunner.aws_launch_template.spot_instance: Refreshing state... [id=lt-05569921ff838be7d]
module.defaultrunner.aws_security_group_rule.runner_default_egress: Refreshing state... [id=sgrule-3257918776]
module.defaultrunner.module.drone_runner_task.aws_security_group_rule.service_default_egress: Refreshing state... [id=sgrule-4019522252]
module.server.module.drone_lb.aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:loadbalancer/app/drone-lb/c95e504b50dd5849]
module.server.module.drone_lb.aws_security_group_rule.lb_ingress: Refreshing state... [id=sgrule-4175306693]
module.server.module.drone_lb.aws_security_group_rule.lb_egress: Refreshing state... [id=sgrule-3624004551]
module.server.aws_security_group_rule.sb_default_egress: Refreshing state... [id=sgrule-2435133580]
module.server.aws_security_group_rule.db_self: Refreshing state... [id=sgrule-4057359195]
module.server.aws_security_group_rule.ssl_ingress: Refreshing state... [id=sgrule-2608004375]
module.server.module.drone_server_task.aws_security_group_rule.service_default_egress: Refreshing state... [id=sgrule-1289973954]
module.server.module.drone_lb.aws_route53_record.cert_validation["drone.paperphyte.com"]: Refreshing state... [id=Z2V3GGOJG8ZCUS__263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com._CNAME]
module.server.aws_security_group_rule.lb_grafana_ingress_rule: Refreshing state... [id=sgrule-2950454811]
module.server.aws_security_group_rule.db_drone_task: Refreshing state... [id=sgrule-4068768885]
module.server.module.drone_server_task.aws_service_discovery_service.discovery_service: Refreshing state... [id=srv-mkp4bi2zbaj6byu6]
module.server.module.drone_lb.aws_acm_certificate_validation.cert_validation: Refreshing state... [id=2021-10-13 16:46:12 +0000 UTC]
module.defaultrunner.aws_security_group_rule.runner_ingress: Refreshing state... [id=sgrule-2199872749]
module.defaultrunner.aws_security_group_rule.runner_rask_ingress: Refreshing state... [id=sgrule-3032061293]
module.defaultrunner.module.drone_runner_task.aws_service_discovery_service.discovery_service: Refreshing state... [id=srv-imjqqjjompk35bbn]
module.server.module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=drone]
module.defaultrunner.aws_autoscaling_group.provider: Refreshing state... [id=terraform-2021101610363527450000000b]
module.server.module.drone_lb.aws_lb_listener.https_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:listener/app/drone-lb/c95e504b50dd5849/6ac6c77e60c12033]
module.server.module.drone_lb.aws_lb_listener.public: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:listener/app/drone-lb/c95e504b50dd5849/a41dd8f171e9ef7e]
module.server.module.drone_lb.aws_route53_record.lb_public_url: Refreshing state... [id=Z2V3GGOJG8ZCUS_drone.paperphyte.com_A]
module.defaultrunner.aws_ecs_capacity_provider.provider: Refreshing state... [id=arn:aws:ecs:eu-north-1:277223786451:capacity-provider/DRONE_MICRO]
module.defaultrunner.module.drone_runner_task.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:eu-north-1:277223786451:service/drone-cluster/drone_micro-runner]
module.server.aws_instance.instance_helper: Refreshing state... [id=i-0ccb7513c052124b9]
module.server.aws_ssm_parameter.data_source: Refreshing state... [id=/drone/db/datasource]
module.defaultrunner.module.drone_runner_task.aws_appautoscaling_target.ecs_service: Refreshing state... [id=service/drone-cluster/drone_micro-runner]
module.server.aws_iam_policy.server_task_policy: Refreshing state... [id=arn:aws:iam::277223786451:policy/server_task_policy]
module.server.module.drone_server_task.aws_ecs_task_definition.task_definition: Refreshing state... [id=drone-server]
module.server.aws_iam_role_policy_attachment.server_task_custom: Refreshing state... [id=drone-server_ecs_task_role-20211013170338517900000001]
module.server.module.drone_server_task.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:eu-north-1:277223786451:service/drone-cluster/drone-server]
module.server.module.drone_server_task.aws_appautoscaling_target.ecs_service: Refreshing state... [id=service/drone-cluster/drone-server]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.server.module.db.module.db_instance.aws_db_instance.this[0] has been changed
  ~ resource "aws_db_instance" "this" {
        id                                    = "drone"
      ~ latest_restorable_time                = "2021-10-16T11:38:48Z" -> "2021-10-16T11:43:49Z"
        name                                  = "drone"
        tags                                  = {
            "Name" = "drone"
        }
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.server.aws_security_group_rule.ssl_ingress has been changed
  ~ resource "aws_security_group_rule" "ssl_ingress" {
        id                = "sgrule-2608004375"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }
  # module.defaultrunner.aws_iam_role.ecs_instance has been changed
  ~ resource "aws_iam_role" "ecs_instance" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = [
                              - "ec2.amazonaws.com",
                                "spotfleet.amazonaws.com",
                              + "ec2.amazonaws.com",
                            ]
                        }
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "drone_micro-ecs-instance-role"
        name                  = "drone_micro-ecs-instance-role"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.server.module.drone_lb.aws_security_group.lb has been changed
  ~ resource "aws_security_group" "lb" {
        id                     = "sg-0f95737b9ea2b3d3f"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "95.198.22.74/32",
                  + "185.199.108.0/22",
                  + "192.30.252.0/22",
                  + "143.55.64.0/20",
                  + "140.82.112.0/20",
                ]
              + description      = "Incoming"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "95.198.57.109/32",
                  - "192.30.252.0/22",
                  - "185.199.108.0/22",
                  - "140.82.112.0/20",
                  - "143.55.64.0/20",
                ]
              - description      = "Incoming"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
            # (2 unchanged elements hidden)
        ]
        name                   = "drone-lb-sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }
  # module.server.module.drone_server_task.aws_security_group.service_sg has been changed
  ~ resource "aws_security_group" "service_sg" {
        id                     = "sg-081a036f662f3d400"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Drone CI/CD build agents to access"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0a27d9aec5ab3b9f9",
                ]
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = []
              - description      = "Drone CI/CD build runners to access"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05ca9e881cfe1a660",
                ]
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Drone CI/CD runner instances to access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0a27d9aec5ab3b9f9",
                ]
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Drone CI/CD runner tasks to access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-05ca9e881cfe1a660",
                ]
              + self             = false
              + to_port          = 80
            },
            # (1 unchanged element hidden)
        ]
        name                   = "drone-server-service-sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.server.module.drone_lb.aws_acm_certificate_validation.cert_validation must be replaced
-/+ resource "aws_acm_certificate_validation" "cert_validation" {
      ~ id                      = "2021-10-13 16:46:12 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.server.module.drone_lb.aws_route53_record.cert_validation["drone.paperphyte.com"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn            = "_263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com" -> (known after apply)
      ~ id              = "Z2V3GGOJG8ZCUS__263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com._CNAME" -> (known after apply)
        name            = "_263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com"
      ~ zone_id         = "Z2V3GGOJG8ZCUS" -> "kalle" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.server.module.drone_lb.aws_route53_record.lb_public_url must be replaced
-/+ resource "aws_route53_record" "lb_public_url" {
      ~ fqdn            = "drone.paperphyte.com" -> (known after apply)
      ~ id              = "Z2V3GGOJG8ZCUS_drone.paperphyte.com_A" -> (known after apply)
        name            = "drone.paperphyte.com"
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z2V3GGOJG8ZCUS" -> "kalle" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.server.module.drone_server_task.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:eu-north-1:277223786451:service/drone-cluster/drone-server"
        name                               = "drone-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-north-1:277223786451:task-definition/drone-server:6" -> (known after apply)
        # (13 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

  # module.server.module.drone_server_task.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-north-1:277223786451:task-definition/drone-server:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "AWS_DEFAULT_REGION"
                          - value = "eu-north-1"
                        },
                      - {
                          - name  = "AWS_REGION"
                          - value = "eu-north-1"
                        },
                      - {
                          - name  = "DRONE_AGENTS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DRONE_CLEANUP_DEADLINE_PENDING"
                          - value = "72h"
                        },
                      - {
                          - name  = "DRONE_CLEANUP_DEADLINE_RUNNING"
                          - value = "6h"
                        },
                      - {
                          - name  = "DRONE_CLEANUP_INTERVAL"
                          - value = "24h"
                        },
                      - {
                          - name  = "DRONE_DATABASE_DRIVER"
                          - value = "postgres"
                        },
                      - {
                          - name  = "DRONE_GITHUB_SERVER"
                          - value = "https://github.com"
                        },
                      - {
                          - name  = "DRONE_HTTP_SSL_REDIRECT"
                          - value = "false"
                        },
                      - {
                          - name  = "DRONE_LOGS_DEBUG"
                          - value = "true"
                        },
                      - {
                          - name  = "DRONE_LOGS_TRACE"
                          - value = "true"
                        },
                      - {
                          - name  = "DRONE_REPOSITORY_FILTER"
                          - value = "paperphyte"
                        },
                      - {
                          - name  = "DRONE_RPC_SERVER"
                          - value = "https://drone.paperphyte.com"
                        },
                      - {
                          - name  = "DRONE_S3_BUCKET"
                          - value = "drone.paperphyte.com-console-logs"
                        },
                      - {
                          - name  = "DRONE_SERVER_HOST"
                          - value = "drone.paperphyte.com"
                        },
                      - {
                          - name  = "DRONE_SERVER_PROTO"
                          - value = "https"
                        },
                      - {
                          - name  = "DRONE_TLS_AUTOCERT"
                          - value = "false"
                        },
                      - {
                          - name  = "DRONE_USER_CREATE"
                          - value = "username:krusipo,machine:false,admin:true"
                        },
                      - {
                          - name  = "DRONE_USER_FILTER"
                          - value = "paperphyte"
                        },
                    ]
                  - essential        = true
                  - image            = "277223786451.dkr.ecr.eu-north-1.amazonaws.com/drone/drone:v2.4.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "drone-cluster"
                          - awslogs-region        = "eu-north-1"
                          - awslogs-stream-prefix = "/drone-server"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "drone-server"
                  - portMappings     = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DRONE_GITHUB_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/github/client_id"
                        },
                      - {
                          - name      = "DRONE_GITHUB_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/github/client_secret"
                        },
                      - {
                          - name      = "DRONE_DATABASE_DATASOURCE"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/db/datasource"
                        },
                      - {
                          - name      = "DRONE_RPC_SECRET"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/server/rpc_secret"
                        },
                      - {
                          - name      = "DRONE_DATABASE_SECRET"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/server/database_secret"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "drone-server" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
      - tags                     = {} -> null
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.


```
</details>
*Pusher: @krusipo, Action: `pull_request`*